<template>
  <div class="inner">
    <div class="title_wrap" :data-layout="props.layoutType">
      <h2>위치기반서비스 이용약관</h2>
    </div>
    <div class="policy_wrap_pc">
      <Selectbox
        :options="[
          { val: 'value', txt: '2024-05-17 (3.00v)' },
          { val: 'value', txt: '2024-02-14 (2.98v)' },
          { val: 'value', txt: '2023-04-22 (2차 개정)' },
          { val: 'value', txt: '2021-03-21 (초안)' }
        ]" />
      <h2>제 1장 총칙</h2>
      <dl>
        <dt>제 1 조 (목적)</dt>
        <dd>
          <span>
            본 약관은 ㈜이니스프리(이하 "회사")이 제공하는 위치기반서비스사업과 관련하여 회사와 이용자(기존 이니스프리 회원, 서비스
            이용약관에 동의한 고객 및 개인위치정보주체를 포함)와의 권리ㆍ의무 및 이용조건과 절차 등 제반 사항을 규정함을 목적으로 합니다.
          </span>
        </dd>
      </dl>
      <dl>
        <dt>제 2 조 (정의)</dt>
        <dd>
          <ul>
            <li>
              1. 본 약관은 서비스를 신청한 고객 또는 개인위치정보주체가 본 약관에 동의하고, 회사가 그에 대한 승낙을 함으로써 효력이
              발생합니다.
            </li>
            <li>
              2. 본 약관은 유ㆍ무선 인터넷을 통하여 홈페이지 또는 모바일 어플리케이션의 초기 화면 또는 그 연결 화면 등 기타 방법에 의하여 그
              내용을 게시 또는 공지합니다.
            </li>
            <li>
              3. 회사가 약관을 개정할 경우에는 적용일자 및 개정내용, 개정사유 등을 명시하여 그 적용일자로부터 7일 이전부터 초기화면 또는
              초기화면과의 연결화면을 통해 공지합니다. 단, 이용자에게 불리하게 약관을 개정하는 경우에는 그 적용일30일 이전부터 공지 외에
              서비스 내 전자우편, 로그인시 동의창 등의 전자적 수단이나 청구서에 표시하여 발송하는 등의 방법을 통해 개별적으로 명확히
              통지합니다.
            </li>
            <li>
              4. 회사가 전항에 따라 개정약관을 공지 또는 통지하면서 이용자에게 30일 기간 내에 의사표시를 하지 않으면 의사표시가 표명된
              것으로 본다는 뜻을 명확하게 따로 공지 또는 고지하였음에도 이용자가 명시적으로 거부의사를 표시하지 아니한 경우 이용자가
              개정약관에 동의한 것으로 봅니다.
            </li>
            <li>
              5. 이용자가 개정약관의 적용에 동의하지 않는 경우 회사는 개정약관의 내용을 적용할 수 없으며, 이 경우 이용자는 이용계약을 해지할
              수 있습니다. 다만, 기존 약관을 적용할 수 없는 특별한 사정이 있는 경우에는 회사는 이용자와의 이용계약을 해지할 수 있습니다.
            </li>
          </ul>
        </dd>
      </dl>

      <dl>
        <dt>제 3 조 (약관 외 준칙)</dt>
        <dd>
          <span>
            본 약관에 명시되지 않은 사항은 위치정보의 보호 및 이용 등에 관한 법률, 정보통신망 이용촉진 및 정보보호 등에 관한 법률,
            전기통신기본법, 전기통신사업법 등 관련 법령(이하 “관련 법령”)과 회사의 웹사이트 이용약관, 개인정보처리방침 이나 회사가 별도로
            정한 지침 등에 의합니다.
          </span>
        </dd>
      </dl>

      <dl>
        <dt>제 4 조 (위치정보 수집방법 및 서비스 내용)</dt>
        <dd>
          <ul>
            <li>
              <span>1. 회사는 다음과 같이 개인위치정보를 수집하고, 이용자에게 서비스를 제공합니다.</span>
              <div class="table_wrap">
                <table>
                  <caption>
                    위치정보 수집방법 및 서비스 내용
                  </caption>
                  <colgroup>
                    <col style="" />
                    <col style="" />
                  </colgroup>
                  <thead>
                    <tr>
                      <th>구분</th>
                      <th>위치정보 수집방법 및 서비스 내용</th>
                    </tr>
                  </thead>
                  <tbody>
                    <tr>
                      <td>GeoLocation API를 이용한 위치정보</td>
                      <td>
                        <ul class="bul_list dot">
                          <li>고객 요청 시 HTML5 GeoLocation API를 활용하여 위치정보를 수집 후 서버로 전송</li>
                          <li>가맹점 DB에서 위치정보와 매핑된 매장목록 확인</li>
                          <li>서비스 이용자에게 근처 매장정보 제공</li>
                        </ul>
                      </td>
                    </tr>
                  </tbody>
                </table>
              </div>
            </li>
            <li style="margin-left: 16px; margin-top: 5px; text-indent: -16px">
              2. 제1항에 따른 개인위치정보의 수집방법 및 서비스의 내용이 변경될 때에는 회사는 미리 홈페이지 등에 공지하거나 이용자에게 별도
              통지합니다. 다만, 회사가 통제할 수 없는 사유가 발생하여 사전 통지가 불가능할 때에는 사후에 통지합니다.
            </li>
          </ul>
        </dd>
      </dl>
      <dl>
        <dt>제 5 조 (개인위치정보의 보유목적 및 보유기간)</dt>
        <dd>
          <span> 회사가 이용자에게 제공하는 위치기반서비스(무상) 및 개인위치정보의 보유목적과 보유기간은 아래와 같습니다. </span>
          <div class="table_wrap">
            <table>
              <caption>
                개인위치정보의 보유목적 및 보유기간
              </caption>
              <colgroup>
                <col style="" />
                <col style="" />
                <col style="" />
              </colgroup>
              <thead>
                <tr>
                  <th>서비스 명</th>
                  <th>보유 목적</th>
                  <th>개인위치정보 보유기간</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <td>가까운 매장 찾기</td>
                  <td>이용자의 현재 위치를 기반으로 가까운 매장 안내</td>
                  <td class="important">
                    서비스 제공 목적 달성 후 지체없이 파기 (단, 위치정보법 및 다른 법령이 달리 정하는 경우에는 그에 따름)
                  </td>
                </tr>
              </tbody>
            </table>
          </div>
        </dd>
      </dl>

      <h2>제 2 장 서비스 이용계약 체결</h2>
      <dl>
        <dt>제 6 조 (서비스이용계약의 성립)</dt>
        <dd>
          <ul>
            <li>
              1. 이용자가 유ㆍ무선 인터넷을 통하여 홈페이지 또는 모바일 어플리케이션을 통하여 이니스프리 회원이 되기 위하여 해당 이용 약관
              및 본 약관에 동의하고, 회사가 그 동의에 승낙함으로써 서비스 이용계약이 성립합니다.
            </li>
            <li>
              2. 회사는 기존 이니스프리 회원이 모바일 단말기를 통하여 본 약관에 동의한 경우에만 그 이용자의 위치정보를 이용합니다. 본 약관에
              동의하지 않은 경우 회사는 이용자가 본 서비스에 접속할 때마다 본 약관에 대한 동의 요청을 할 수 있습니다.
            </li>
          </ul>
        </dd>
      </dl>
      <dl>
        <dt>제 7 조 (회사의 이용신청의 승낙)</dt>
        <dd>
          <ul>
            <li>1. 회사는 이용자가 이용신청을 하였을 때 다음 제2항, 제3항의 경우를 제외하고 승낙할 수 있습니다</li>
            <li>
              2. 회사는 다음의 경우 이용신청에 대하여는 승낙을 유보할 수 있습니다.
              <ul>
                <li>1) 위치기반 서비스 이용설비에 여유가 없는 경우</li>
                <li>2) 기술상 서비스 제공이 불가능한 경우</li>
                <li>3) 회사의 타 서비스에 영향을 줄 수 있다고 판단되는 경우</li>
                <li>4) 기타 사유로 이용승낙이 곤란한 경우</li>
              </ul>
            </li>
            <li>
              3. 회사는 다음 각 호의 1에 해당하는 이용신청에 대하여 이를 승낙 하지 않을 수 있습니다.
              <ul>
                <li>1) 이름이 실명이 아닌 경우</li>
                <li>2) 다른 사람의 명의를 사용하여 신청한 경우</li>
                <li>3) 이용신청 시 필요내용을 허위로 기재하여 신청한 경우</li>
                <li>4) 사회의 안녕질서 또는 미풍양속을 저해할 목적으로 신청한 경우</li>
                <li>5) 회사의 기본 음성통화 및 타 서비스에 영향을 줄 수 있다고 판단되는 경우</li>
                <li>6) 기타 회사가 정한 이용신청요건이 충족되지 않았을 경우</li>
              </ul>
            </li>
            <li>
              4. 회사는 이용자가 이용신청을 함에 제3항의 사유가 있었음을 회사의 승낙 후에 인지하게 되는 경우 서비스 이용을 제한 또는
              정지하거나 이용자와의 서비스 이용계약을 해지할 수 있습니다.
            </li>
          </ul>
        </dd>
      </dl>
      <dl>
        <dt>제 8 조 (서비스의 수준)</dt>
        <dd>
          <ul>
            <li>
              1. 서비스의 이용은 연중무휴 1일 24시간을 원칙으로 합니다. 단, 회사의 업무상ㆍ기술상의 이유로 서비스가 일시 중단될 수 있으며,
              이러한 경우 회사는 사전 또는 사후에 이를 공지합니다.
            </li>
            <li>
              2. 회사의 위치정보서비스는 관련 기술의 수준에 따라 오차가 발생할 수 있고 회사의 서비스 제공 당시 기술 수준에 비추어 통상 생길
              수 있는 오차의 경우 회사는 그에 관한 책임을 지지 않습니다.
            </li>
          </ul>
        </dd>
      </dl>
      <dl>
        <dt>제 9 조 (서비스의 변경 및 중지)</dt>
        <dd>
          <ul>
            <li>
              1.회사는 다음 각 호 1에 해당하는 사유가 발생하는 경우 서비스의 전부 또는 일부를 제한, 변경하거나 중지할 수 있습니다.
              <ul>
                <li>1) 서비스용 설비의 보수 등 공사로 부득이한 경우</li>
                <li>2) 정전, 설비 장애, 이용량의 폭주 등으로 정상적인 서비스 이용에 지장이 있는 경우</li>
                <li>3) 서비스 제휴업체와의 계약 종료 등과 같은 법률상의 사정으로 서비스를 유지할 수 없는 경우</li>
                <li>
                  4) 천재지변, 국가비상사태, 법령의 변경, 법원이나 국가기관의 판결, 처분, 명령 등 불가항력적 사유로 서비스를 유지할 수 없는
                  경우
                </li>
              </ul>
            </li>
            <li>
              2. 제1항에 의하여 서비스를 중단하는 경우 회사는 홈페이지(www.innisfree.com), 유/무선 인터넷 서비스 화면 등으로 그 사유 및 제한
              기간 등을 공지하거나 이용자에게 개별 통지합니다. 단, 회사가 통제 불가능한 사정으로 인하여 사전 통지가 불가능한 경우에는 사후에
              통지합니다.
            </li>
          </ul>
        </dd>
      </dl>
      <dl>
        <dt>제 10 조 (위치정보의 이용ㆍ제공 사실 확인 자료의 보유근거 및 보유기간)</dt>
        <dd>
          <span>
            회사는 이용 이용자와의 민원처리를 위해 위치정보법 제16조 제2항에 근거하여 이용자에 대한 위치정보의 이용 제공사실 확인자료를
            위치정보시스템에 자동으로 기록하며 이를 기록 시점으로부터 6개월 동안 보관합니다.
          </span>
        </dd>
      </dl>
      <dl>
        <dt>제 11 조 (이용자의 의무)</dt>
        <dd>
          <ul>
            <li>
              1. 이용자는 서비스의 이용 시에 다음 각 호 1에 해당하는 행위를 하여서는 아니됩니다.
              <ul>
                <li>1) 이용신청 또는 변경 시 허위 사실을 기재하거나 회사에 통보하는 경우</li>
                <li>2) 타인의 명예를 손상시키거나 훼손하여 불이익을 주는 행위</li>
                <li>3) 공공질서 및 미풍양속에 반하는 내용의 문언, 음향, 도형 등의 정보를 타인에게 유포</li>
                <li>4) 서비스와 관련된 설비의 오작동이나 정보 등의 파괴 및 혼란을 유발하는 바이러스 유포</li>
                <li>5) 타인으로 가장하는 행위나 타인과의 관계를 허위로 명시하는 행위</li>
                <li>6) 기타 회사의 업무를 방해하거나 관계법령, 본 약관, 이용 안내나 공지사항의 미준수</li>
              </ul>
            </li>
            <li>
              2. 이용자는 서비스 이용에 필요한 정보를 제공, 등록하는 경우 사실과 일치하는 정보를 제공, 등록하여야 한다. 이용자는 이용신청 시
              기재한 사항이 변경되었을 경우 유ㆍ무선 인터넷을 통한 온라인 또는 회사가 정한 별도의 이용방법으로 정해진 양식 및 방법에 의하여
              정보를 수정하여야 합니다.
            </li>
            <li>
              3. 회사는 이용자가 제1항이나 제2항을 위반하여 변경사항을 통지하지 않거나 갱신하지 않음으로써 발생하는 문제에 관하여 책임을
              지지 않으며, 이용자가 제1항의 행위를 하는 경우 서비스 이용 제한, 정지하거나 해지할 수 있습니다.
            </li>
          </ul>
        </dd>
      </dl>

      <h2>제 3 장 개인위치정보주체의 권리</h2>
      <dl>
        <dt>제 12 조 (개인위치정보의 보호)</dt>
        <dd>
          <span
            >회사는 “위치정보의 보호 및 이용 등에 관한 법률”(이하 “위치정보법”) 등 관련 법령이 정하는 바에 따라 이용자의 개인위치정보를
            보호하기 위해 노력합니다. 개인위치정보의 보호 및 사용에 관해서는 관련 법령 및 회사의 개인정보처리방침이 적용됩니다.</span
          >
        </dd>
      </dl>
      <dl>
        <dt>제 13 조 (개인위치정보주체의 위치정보 수집 및 이용에 관한 동의)</dt>
        <dd>
          <span
            >이용자는 개인위치정보의 수집여부 및 범위와 이용 등에 대하여 동의를 유보할 수 있습니다. 동의하지 않은 이용자의 경우 모바일
            단말기에서 위치기반서비스의 이용에 제한이 있을 수 있습니다.</span
          >
        </dd>
      </dl>
      <dl>
        <dt>제 14 조 (개인위치정보주체의 권리 등)</dt>
        <dd>
          <ul>
            <li>1. 이용자는 회사에 대하여 언제든지 개인위치정보의 이용 및 제공에 대한 동의의 전부 또는 일부를 철회할 수 있습니다.</li>
            <li>2. 이용자는 회사에 대하여 언제든지 개인위치정보의 수집, 이용 또는 제공의 일시적인 중지를 요구할 수 있습니다.</li>
            <li>
              3. 이용자는 회사에 대하여 다음 각 호의 1의 자료 등의 열람 또는 고지를 요구할 수 있고, 당해 자료 등에 오류가 있는 경우에는 그
              정정을 요구할 수 있으며 회사는 정당한 이유 없이 그 요구를 거절하지 아니합니다.
              <ul>
                <li>1) 본인에 대한 위치정보 수집ㆍ이용ㆍ제공사실 확인 자료</li>
                <li>2) 본인의 개인위치정보가 제3자에게 제공된 이유 및 내용</li>
              </ul>
            </li>
            <li>
              4. 회사는 이용자가 제1항의 규정에 의하여 동의의 전부 또는 일부를 철회한 경우에는 지체 없이 수집된 개인위치정보 및 위치정보
              수집ㆍ이용ㆍ제공사실 확인자료(동의의 일부를 철회하는 경우에는 철회하는 부분의 개인위치정보 및 위치정보 이용ㆍ제공사실
              확인자료에 한 함)를 파기합니다.
            </li>
            <li>5. 이용자는 이 조의 권리행사를 위하여 방문, 전화, 인터넷 등의 방법으로 회사에 대한 요구사항을 신청할 수 있습니다.</li>
          </ul>
        </dd>
      </dl>
      <dl>
        <dt>제 15 조 (법정대리인의 권리)</dt>
        <dd>
          <ul>
            <li>
              1. 회사는 만 14세 미만의 회원으로부터 개인위치정보를 수집ㆍ이용 또는 제공하고자 하는 경우에는 만14세 미만 이용자와 그
              법정대리인의 동의를 받아아 합니다.. 이 경우 법정대리인은 제13조에 의한 권리를 모두 가집니다.
            </li>
            <li>
              회사는 14세 미만의 이용자의 개인위치정보 또는 위치정보 이용, 제공사실 확인자료를 이용약관에 명시 또는 고지한 범위를 넘어
              이용하거나 제3자에게 제공하고자 하는 경우에는 14세 미만의 이용자와 그 법정대리인의 동의를 받아야 합니다. 단, 아래의 경우는
              제외합니다.
              <ul>
                <li>1) 위치정보 및 위치기반서비스 제공에 따른 요금정산을 위하여 위치정보 이용, 제공사실 확인자료가 필요한 경우</li>
                <li>2) 통계작성, 학술연구 또는 시장조사를 위하여 특정 개인을 알아볼 수 없는 형태로 가공하여 제공하는 경우</li>
              </ul>
            </li>
          </ul>
        </dd>
      </dl>
      <dl>
        <dt>제 16 조 (8세 이하의 아동 등의 보호의무자의 권리)</dt>
        <dd>
          <ul>
            <li>
              1. 회사는 아래의 경우에 해당하는 자(이하 “8세 이하의 아동 등”이라고 합니다)의 보호의무자가 8세 이하의 아동 등의 생명 또는
              신체보호를 위하여 개인위치정보의 수집ㆍ이용 또는 제공에 동의하는 경우에는 본인의 동의가 있는 것으로 봅니다.
              <ul>
                <li>① 8세 이하의 아동</li>
                <li>② 피성년후견인</li>
                <li>
                  ③ 장애인복지법 제2조 제2항 제2호의 규정에 따른 정신적 장애를 가진 자로서 장애인 고용촉진 및 직업재활법 제2조 제2호의
                  규정에 따라 중증장애인에 해당하는 자(장애인복지법 제32조의 규정에 따라 장애인등록을 한 자에 한합니다)
                </li>
              </ul>
            </li>
            <li>
              2. 전항의 규정에 따른 8세 이하 아동 등의 보호의무자는 해당 아동을 사실상 보호하는 자로서 다음 각 호에 해당하는 자를 말합니다.
              <ul>
                <li>① 8세 이하의 아동의 법정대리인 또는 보호시설에 있는 미성년자의 후견 직무에 관한 법률 제3조의 규정에 따른 후견인</li>
                <li>② 피성년후견인의 법정대리인</li>
                <li>
                  ③ 이 조 제1항 제3호의 자의 법정대리인 또는 장애인복지법 제58조 제1항 제1호의 규정에 따른 장애인생활시설(국가 또는
                  지방자치단체가 설치ㆍ운영하는 시설에 한합니다)의 장, 정신건강증진 및 정신질환자 복지서비스 지원에 관한 법률 제22조에 따른
                  정신요양시설의 장 및 같은 법 제26조에 따른 정신재활시설(국가 또는 지방자치단체가 설치ㆍ운영하는 시설로 한정한다)의 장
                </li>
              </ul>
            </li>
            <li>
              3. 8세 이하의 아동 등의 생명 또는 신체의 보호를 위하여 개인위치정보의 수집ㆍ이용 또는 제공에 동의를 하고자 하는 보호의무자는
              서면동의서에 보호의무자임을 증명하는 서면을 첨부하여 회사에 제출하여야 합니다.
              <ul>
                <li>① 8세 이하의 아동 등의 성명, 주소 및 생년월일</li>
                <li>② 보호의무자의 성명, 주소 및 연락처</li>
                <li>③ 개인위치정보 이용 또는 제공의 목적이 8세 이하의 아동등의 생명 또는 신체의 보호에 한정된다는 사실</li>
                <li>④ 동의의 연월일</li>
              </ul>
            </li>
            <li>
              4. 보호의무자는 8세 이하의 아동 등의 개인위치정보 수집ㆍ이용 또는 제공에 동의하는 경우 이용자 권리의 전부를 행사할 수
              있습니다.
            </li>
          </ul>
        </dd>
      </dl>
      <dl>
        <dt>제 18 조 (제3자 위치정보 제공 즉시통보)</dt>
        <dd>
          <ul>
            <li>
              제3자에게 위치정보를 제공하는 서비스의 경우, 회사는 개인위치정보를 수집 및 제공한 즉시 개인위치정보를 수집한 당해
              통신단말장치로 매회 이용자에게 SMS 등의 방법으로 제공 받은 자, 제공 일시, 제공 목적을 통보하여야 합니다.
            </li>
            <li>
              회사가 개인위치정보를 이용자가 지정하는 제3자에게 제공하는 서비스를 하고자 하는 경우에는 제1항 각 호의 내용을 이용약관에
              명시한 후 제공받는 자 및 제공목적을 이용자에게 고지하고 동의를 얻어야 합니다.
            </li>
            <li>
              회사는 다음에 해당하는 경우에는 이용자가 미리 특정하여 지정한 통신단말장치 또는 전자우편주소 등으로 통보하여야 합니다.
              <ul>
                <li>1) 개인위치정보를 수집한 당해 통신단말장치가 문자, 음성 또는 영상의 수신기능을 갖추지 아니한 경우</li>
                <li>
                  2) 이용자가 개인위치정보를 수집한 당해 통신단말장치 외의 통신단말장치 또는 전자우편주소 등으로 통보할 것을 미리 요청한
                  경우.
                </li>
              </ul>
            </li>
          </ul>
        </dd>
      </dl>
      <h2>제 5 장 손해배상 및 면책사항</h2>
      <dl>
        <dt>제 19 조 (손해배상)</dt>
        <dd>
          <ul>
            <li>
              1. 이용자는 위치정보법 제15조 내지 제26조의 규정에 위반한 행위로 손해를 입은 경우에 회사에 대하여 손해배상을 청구할 수
              있습니다.
            </li>
            <li>2. 이용자는 자신의 귀책사유로 인하여 회사에 발생한 손해를 배상하여야 합니다.</li>
          </ul>
        </dd>
      </dl>
      <dl>
        <dt>제 20 조 (분쟁의 조정 등)</dt>
        <dd>
          <ul>
            <li>1. 회사와 이용자 사이에 분쟁이 발생한 경우, 쌍방간에 분쟁의 해결을 위해 성실히 협의하도록 합니다.</li>
            <li>
              2. 회사와 이용자는 위치정보에 관한 분쟁에 대하여 당사자간에 협의가 이루어지지 아니하거나 협의를 할 수 없는 경우에는
              방송통신위원회에 조정을 신청하거나, 개인정보보호법 제43조에 의한 방송통신위원회 또는 개인정보분쟁조정위원회에 재정 또는
              분쟁조정을 신청할 수 있습니다.
            </li>
            <li>3. 전항으로도 분쟁이 해결되지 않으면 회사와 이용자 양 당사자는 민사소송법상의 관할법원에 소를 제기할 수 있습니다.</li>
          </ul>
        </dd>
      </dl>
      <dl>
        <dt>제 21 조 (면책사항)</dt>
        <dd>
          <ul>
            <li>1. 회사는 불가항력으로 인하여 위치기반서비스를 제공할 수 없는 경우에는 위치기반 서비스 제공에 관한 책임이 면제됩니다.</li>
            <li>2. 회사는 이용자의 귀책사유로 인한 위치기반서비스의 이용장애에 대하여 책임을 지지 않습니다.</li>
            <li>3. 회사는 이용자가 서비스를 이용하여 기대수익을 상실한 것에 대하여 책임을 지지 않습니다.</li>
            <li>
              4. 전파의 직진 및 회절 특성에 따른 예측할 수 없는 음영지역의 발생, 장비의 성능개선을 위하여 필요한 경우 등 전기통신서비스의
              특성상 불가피한 사유로 서비스 제공이 불가능한 경우에는 회사는 서비스 미 제공에 관한 책임이 면제됩니다.
            </li>
          </ul>
        </dd>
      </dl>
      <dl>
        <dt>제 22 조 (회사의 서비스 이용약관과 관계)</dt>
        <dd>
          <span>본 약관은 회사의 위치기반서비스사업과 위치기반서비스의 제공에 관하여는 회사의 이니스프리 약관에 우선하여 적용됩니다.</span>
        </dd>
      </dl>
      <dl>
        <dt>제 23 조 (사업자 정보 및 위치정보 관리책임자)</dt>
        <dd>
          <ul>
            <li>
              1. 회사의 상호, 주소, 전화번호 그 밖의 연락처는 다음과 같습니다.
              <ul>
                <li>상호: ㈜이니스프리</li>
                <li>주소: 서울특별시 용산구 한강대로 100 (한강로 2가) 7층 이니스프리</li>
                <li>대표전화: 080-380-0114</li>
                <li>이메일 주소: innisfree@innisfree.com</li>
              </ul>
            </li>
            <li>
              2. 회사는 위치정보를 적절히 관리ㆍ보호하고 이용자의 불만을 원활히 처리할 수 있도록 실질적인 책임을 질 수 있는 지위에 있는 자를
              위치정보관리책임자로 지정해 운영합니다.
              <ul>
                <li>위치정보 관리책임자 : 정구화 Division장</li>
                <li>대표전화: 080-380-0114</li>
                <li>이메일 주소: innisfree_privacy@innisfree.com</li>
              </ul>
            </li>
          </ul>
        </dd>
      </dl>
      <dl class="supple_pro">
        <dt>&lt;부칙&gt; 2012. 2. 13.</dt>
        <dd>
          <span>제1조(시행일) 이 약관은 2012년 2월 13일부터 시행합니다.</span>
        </dd>
      </dl>
    </div>
  </div>

  <!--modal-->
  <div class="modal_wrap" id="delete_modal">
    <div class="modal_container">
      <div class="modal_header">
        <h2>알림</h2>
        <button class="btn_close" @click="modal.close(this)">닫기</button>
      </div>
      <div class="modal_content">
        <div>삭제하시겠습니까?</div>
      </div>
      <div class="modal_footer">
        <Button class="btn_big confirm" txt="확인" />
        <Button class="btn_big" txt="취소" @click="modal.close(this)" />
      </div>
    </div>
    <div class="overlay" @click="modal.close(this)"></div>
  </div>
</template>

<script setup>
import { definePageMeta, onMounted } from '#imports'

definePageMeta({
  layout: 'publish-pc-category'
})

const props = defineProps({
  layoutType: {
    type: String,
    default: 'default'
  }
})

import { modal } from '@inmModule/assets/js/common-ui'

onMounted(() => {})
</script>

<style lang="scss" scoped>
.important {
  font-size: 16.8px !important;
  text-decoration: underline;
}

:deep(.dot) {
  display: flex;
  flex-direction: column;
  align-items: center;
}

:deep(.title_wrap) {
  h2 {
    font-weight: 600;
  }
}

:deep(.select) {
  > div {
    width: 320px;
    margin-bottom: 40px;
  }
}

.table_wrap {
  margin-top: 10px;
  margin-bottom: 10px;
  border-top: 2px solid #000;
  table {
    width: 100%;
    border-collapse: collapse;
    border: 0;
    table-layout: fixed;
    caption {
      display: none;
    }
    thead {
      tr {
        th {
          padding: 10px 5px;
          color: #666;
          font-size: 13px;
          font-weight: 500;
          border-bottom: 1px solid #eee;
          border-left: 1px solid #eee;
          background: #f5f5f5;
          text-align: center;
          &:first-of-type {
            border-left: 0;
          }
        }
      }
    }
    tbody {
      tr {
        th {
          padding: 24px 0px;
          color: #666;
          font-size: 16px;
          border-bottom: 1px solid #f5f5f5;
          text-align: center;
          em {
            margin-left: -10px;
            margin-right: 3px;
            color: #ff0000;
          }
        }
        td {
          padding: 20px;
          font-size: 13px;
          font-weight: 400;
          border-bottom: 1px solid #f5f5f5;
          border-left: 1px solid #eee;
          text-align: center;
          &:first-of-type {
            border-left: none;
          }
          ul {
            li {
              text-indent: -2px;
            }
          }
        }
      }
    }
  }
}

.modal_wrap {
  &#delete_modal {
    .modal_container {
      .modal_header {
        padding: 2rem;
        h2 {
          font-size: 1.8rem;
        }
      }
      .modal_content {
        padding: 3rem;
      }
    }
  }
}
</style>
